Step5-meshGenSnappyHexMesh/confluenceSnappy/Allrun
#!/bin/bash

rm -r 0
rm -r pro*
foamCleanPolyMesh
foamListTimes -rm

blockMesh
decomposePar
mpirun -np 4 snappyHexMesh -overwrite -parallel

reconstructParMesh -constant
rm -r pro*
